
a_str = "Hello"          #Создать переменную типа String
a_int = 10                #Создать переменную типа Integer
a_float = 5.432           #Создать переменную типа Float, плав  запятая
a_bytes = b"World"         #тип Bytes хранится в двоичном виде
a_list = [1, 2, 3]          #тип List список разных типов данных, можно менять
a_tuple = (4, 5, 6)         #тип Tuple список разных типов данных, нельзя менять
a_set = {7, 8, 7}        #тип Set множество, можно добавлять и удалять, нельзя элементы изменять, удаляет дубли
a_fr_set = frozenset([5, 4, 3, 4])   #тип Frozen set неупорядоченная, неизменяемая последовательность, удаляет дубли
a_dict = {'Company': 'Toyota', 'Model': 'Camry', 'Year': 2020}       #тип Dict массив - ключи и значения

# 10 Вывести в консоль все выше перечисленные переменные с добавлением типа данных.

ll = [a_str, a_int, a_float, a_bytes, a_list, a_tuple, a_set, a_fr_set, a_dict]
for i in ll:
    print(i, type(i))

print('==================')
str_1 = 'Hello '
str_2 = 'World'
str_3 = str_1 + str_2
print(str_3)                # 11. 2 переменные String, создать переменную в которой сканкатенируете эти переменные

print(a_str, ',', a_int)         # 12 Вывести в одну строку переменные типа String и Integer используя “,”

print(a_str + str(a_int))            # 13 Вывести в одну строку переменные типа String и Integer используя “+”

