
# Задача №1
# Обменник. Создать скрипт который будет запускаться из консоли 1 раз из консоли, выдавать результат и зарываться.
#     1. На вход обменнику вводишь количество денег int.
#     2. На выходе в консоль выводится отввет в таком виде:
#                 "Ты ввёл int (Валюта)"
#                 "конвертированная сумма в USD = int"
#     3. Валюту пользователя определите сами

kol_rub = int(input("Введи количество рублей: "))
print('Ты ввёл', kol_rub, 'руб.')
print('Конвертированная сумма в USD =', kol_rub / 2.5)

print('===========================================')

# Задача №2
# Обменник. Создать скрипт который будет запускаться из консоли 1 раз из консоли, выдавать результат и зарываться.
#     1. На вход обменнику вводишь количество денег int.
#     2. На выходе в консоль выводится отввет в таком виде:
#                 "Ты ввёл int (Валюта)"
#                 "Конвертированная сумма в USD = int"
#                 "Конвертированная сумма в EUR = int"
#                 "Конвертированная сумма в CHF = int"
#                 "Конвертированная сумма в GBP = int"
#                 "Конвертированная сумма в CNY = int"
#     3. Валюту пользователя определите сами.


kol_rub = int(input("Введи количество рублей: "))
print('Ты ввел', kol_rub, 'руб.')

print('Конвертированная сумма в USD =', kol_rub / 2.5)
print('Конвертированная сумма в EUR =', kol_rub / 3)
print('Конвертированная сумма в CHF =', kol_rub / 2.82)
print('Конвертированная сумма в GBP =', kol_rub / 3.49)
print('Конвертированная сумма в CNY =', kol_rub / 0.4066)

print('===========================================')

# Задача №3 - сделать 2 варианта - с функциями из других файлов и весь код в одной процедуре
# Обменник. Создать скрипт который будет запускаться из консоли 1 раз из консоли, выдавать результат и зарываться.
# 1. На вход обменнику вводишь количество денег int.
# 2. На выходе в консоль выводится отввет в таком виде:
#                 "Ты ввёл int (Валюта)"
#                 "конвертированная сумма в USD = int"
#                 "конвертированная сумма в EUR = int"
#                 "конвертированная сумма в CHF = int"
#                 "конвертированная сумма в GBP = int"
#                 "конвертированная сумма в CNY = int"
# 3. Скипт должен выдать сообщение
#                 "Введите положительное число." Если число меньше 0.
#                 "Вы ввели не число. Введите число." Если введены буквы.
#                 "Вы ввели пустое поле. Введите число." Если введено пустое значение
# 4. Валюту пользователя определите сами.

from Python_Library import Lib_obmen
from Python_Library import Lib_wwod_summ

kol_rub = input("Введите количество рублей: ")     # 3-1 вариант - с использованием функций

Lib_wwod_summ(kol_rub)

if kol_rub.isnumeric():
    print('Вы ввели', kol_rub, 'руб.')
    Lib_obmen(kol_rub)

#------------------------

kol_rub = input("Введите количество рублей: ")     # 3-2 вариант - весь код в одной процедуре

if kol_rub.isspace() or len(str(kol_rub)) == 0:
    print('Вы ввели пустое поле. Введите число.')

if len(str(kol_rub)) > 1 and str(kol_rub)[0]=='-':
    print('Введите положительное число.')

if kol_rub.isnumeric():
    print('Вы ввели', kol_rub, 'руб.')
    print('Конвертированная сумма в USD =', int(kol_rub) / 2.5)
    print('Конвертированная сумма в EUR =', int(kol_rub) / 3)
    print('Конвертированная сумма в CHF =', int(kol_rub) / 2.82)
    print('Конвертированная сумма в GBP =', int(kol_rub) / 3.49)
    print('Конвертированная сумма в CNY =', int(kol_rub) / 0.4066)

if kol_rub.isalpha():
    print('Вы ввели не число. Введите число.')

print('==========================================')

# Задача №4 - сделать 2 варианта - с функциями из других файлов и весь код в одной процедуре
# Обменник. Скрипт запускается в консоли и работает постоянно. Остановится нажатием ctrl+c.
# 1. Скрипт сначала выводит "Выберите валюту из ['USD','EUR','CHF','GBP','CNY']"
# 2. Пользователь вводит один из 5 вариантов ['USD','EUR','CHF','GBP','CNY']
# 3. Потом Скрипт выводит "Введите сумму"
# 4. Пользователь вводит сумму int
# 5. Скрипт выводит:
#             "Вы ввели сумму int и валюту "Валюта" "
#             "конвертированная сумма в "Валюта" = int"
# 6. Скипт должен выдать сообщение
#                 "Введите положительное число." Если число меньше 0.
#                 "Вы ввели не число. Введите число." Если введены буквы.
#                 "Вы ввели пустое поле. Введите число." Если введено пустое значение.
# 7. После сообщеня об ошибке, скрипт должен автоматом вернуться к шагу 1.
# 8. Валюту пользователя определите сами.

while True:
    valuta = input("Выберите валюту из ['USD','EUR','CHF','GBP','CNY'] ")       # 4-1 вариант весь код в процедуре
    kol_rub = input('Введите сумму рублей ')

    if kol_rub.isalpha():
        print('Вы ввели не число. Введите число.')

    if kol_rub.isspace() or len(str(kol_rub)) == 0:
        print('Вы ввели пустое поле. Введите число.')

    if len(str(kol_rub)) > 1 and str(kol_rub)[0]=='-':
        print('Введите положительное число.')

    if kol_rub.isnumeric():
        print('Вы ввели сумму', kol_rub, 'руб. и валюту', valuta)
        ll = {'USD': 2.5, 'EUR': 3, 'CHF': 2.82, 'GBP': 3.49, 'CNY': 0.406}
        for kk, vv in ll.items():
            if valuta == kk:
                print('конвертированная сумма в', valuta, '=', int(kol_rub) / vv)
                exit()

    print('-------------------------------------')

from Python_Library import Lib_vybor_val

while True:
    valuta = input("Выберите валюту из ['USD','EUR','CHF','GBP','CNY'] ")       # 4-2 вариант c функциями
    kol_rub = input('Введите сумму рублей ')

    Lib_wwod_summ(kol_rub)
    Lib_vybor_val(valuta, kol_rub)

    print('-------------------------------------')

